### Add/Remove Rows and Columns From DataFrames

In [53]:
people = {
    "first": ["Jatin", 'Jane', 'John'], 
    "last": ["Dhiman", 'Doe', 'Doe'], 
    "email": ["JatinDhiman@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [54]:
import pandas as pd

In [55]:
df = pd.DataFrame(people)

In [56]:
df

   first    last                  email
0  Jatin  Dhiman  JatinDhiman@gmail.com
1   Jane     Doe      JaneDoe@email.com
2   John     Doe      JohnDoe@email.com

ADDING COLUMNS

In [30]:
df['first'] + ' ' + df['last']

0    Jatin Dhiman
1        Jane Doe
2        John Doe
dtype: object

In [31]:
df['full_name'] = df['first'] + ' ' + df['last']

In [32]:
df

   first    last                  email     full_name
0  Jatin  Dhiman  JatinDhiman@gmail.com  Jatin Dhiman
1   Jane     Doe      JaneDoe@email.com      Jane Doe
2   John     Doe      JohnDoe@email.com      John Doe

REMOVING COLUMNS

In [33]:
df.drop(columns=['first','last'])

                   email     full_name
0  JatinDhiman@gmail.com  Jatin Dhiman
1      JaneDoe@email.com      Jane Doe
2      JohnDoe@email.com      John Doe

In [34]:
df

   first    last                  email     full_name
0  Jatin  Dhiman  JatinDhiman@gmail.com  Jatin Dhiman
1   Jane     Doe      JaneDoe@email.com      Jane Doe
2   John     Doe      JohnDoe@email.com      John Doe

In [35]:
df.drop(columns=['first','last'],inplace=True)

In [36]:
df

                   email     full_name
0  JatinDhiman@gmail.com  Jatin Dhiman
1      JaneDoe@email.com      Jane Doe
2      JohnDoe@email.com      John Doe

Reverse the process full_name to first ans Last ?

In [37]:
df['full_name'].str.split(' ')

0    [Jatin, Dhiman]
1        [Jane, Doe]
2        [John, Doe]
Name: full_name, dtype: object

In [38]:
df['full_name'].str.split(' ',expand=True)

       0       1
0  Jatin  Dhiman
1   Jane     Doe
2   John     Doe

In [39]:
df[['first','last']] = df['full_name'].str.split(' ',expand=True)

In [40]:
df

                   email     full_name  first    last
0  JatinDhiman@gmail.com  Jatin Dhiman  Jatin  Dhiman
1      JaneDoe@email.com      Jane Doe   Jane     Doe
2      JohnDoe@email.com      John Doe   John     Doe

ADDING ROWS

Adding Single Row

In [41]:
new_row = pd.DataFrame([{'first': 'Tony'}])

In [42]:
df = pd.concat([df,new_row],ignore_index=True)

In [43]:
df

                   email     full_name  first    last
0  JatinDhiman@gmail.com  Jatin Dhiman  Jatin  Dhiman
1      JaneDoe@email.com      Jane Doe   Jane     Doe
2      JohnDoe@email.com      John Doe   John     Doe
3                    NaN           NaN   Tony     NaN

In [57]:
people = {
    "first": ["Tony", 'Steve'], 
    "last": ["Stark", 'Rogers'], 
    "email": ["TonyStark@gmail.com", 'cap@avenge.com']
}

In [58]:
df2 = pd.DataFrame(people)

In [59]:
df2

   first    last                email
0   Tony   Stark  TonyStark@gmail.com
1  Steve  Rogers       cap@avenge.com

In [60]:
df = pd.concat([df,df2],ignore_index=True)

In [61]:
df

   first    last                  email
0  Jatin  Dhiman  JatinDhiman@gmail.com
1   Jane     Doe      JaneDoe@email.com
2   John     Doe      JohnDoe@email.com
3   Tony   Stark    TonyStark@gmail.com
4  Steve  Rogers         cap@avenge.com

Removing Rows

In [62]:
df.drop(index=4)

   first    last                  email
0  Jatin  Dhiman  JatinDhiman@gmail.com
1   Jane     Doe      JaneDoe@email.com
2   John     Doe      JohnDoe@email.com
3   Tony   Stark    TonyStark@gmail.com

In [63]:
df

   first    last                  email
0  Jatin  Dhiman  JatinDhiman@gmail.com
1   Jane     Doe      JaneDoe@email.com
2   John     Doe      JohnDoe@email.com
3   Tony   Stark    TonyStark@gmail.com
4  Steve  Rogers         cap@avenge.com

In [64]:
df.drop(index=4,inplace=True)

In [65]:
df

   first    last                  email
0  Jatin  Dhiman  JatinDhiman@gmail.com
1   Jane     Doe      JaneDoe@email.com
2   John     Doe      JohnDoe@email.com
3   Tony   Stark    TonyStark@gmail.com

In [67]:
filt = (df['last'] == 'Doe')

In [68]:
df.drop(index=df[filt].index)

   first    last                  email
0  Jatin  Dhiman  JatinDhiman@gmail.com
3   Tony   Stark    TonyStark@gmail.com